// Задание 1
/* 
Определите переменные str, num, flag и txt
со значениями «Привет», 123, true, «true».
При помощи оператора определения типа убедитесь,
что переменных принадлежат типам: string, number, boolean.
*/


// Задание 2
/* 
Создайте переменные a1, a2, a3, a4, a5. При помощи
математических операторов (сложение, вычитание
и т.д.) найдите значения выражений: 5 + 3, 5 - 3, 5 * 3, 5 / 3,
поместив результат каждого выражения в соответствующую
переменную, например, let a1 = 5 + 3.
*/

// Задание 3
/* Создайте переменные a6, a7, a8, a9, a10. 
Поместите в них результат выражений: 
5 % 3, 3 % 5, 5 + '3','5' - 3, 75 + 'кг'
*/

// Задание 4
/* 
Напишите скрипт, который находит площадь 
прямоугольника высота 23см. (в числовую переменную height),
шириной 10см (в числовую переменную width), 
значение площади должно хранится в числовой переменной s.
*/


// Задание 5
/*
Напиши скрипт, который находит объем цилиндра высотой 10м
(переменная heightC) и диаметром основания 4м (dC),
результат поместите в переменную v.
*/


// Задание 6
/*
У прямоугольного треугольника две стороны n (со значением 3)
и m (со значением 4). Найдите гипотенузу k по теореме 
Пифагора (нужно использовать функцию Math.pow(число, степень) 
или оператор возведения в степень ** ).
*/


// Задание 7 (*)
/* 
Найди двенадцатый элемент (let nFib = 12, el12;)
последовательности Леонардо Пизанского (нужно
использовать функцию Math.pow(число, степень)).
Не забудьте округлить полученное число 
до целого — Math.round(число).
*/


// Задание 8 (*)
/*
Даны размер ипотечного кредита (S — 2 млн.руб),
процентная ставка (p  — 10%), кол-во лет (years — 5).
Найти переплату по кредиту, значение переплаты должно
содержаться в переменной perepl.
*/